# AddinFolder Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IEntryPoint..::..AddinFolder Property
IEntryPoint Interface See Also
---
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
string AddinFolder { get; }
```

Visual Basic
---
```text
ReadOnly Property AddinFolder As String
	Get
```

Visual C++
---
```text
property String^ AddinFolder {
	String^ get ();
}
```

# See Also
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace